## Estadística Aplicada
Sesión 3 - 15 agosto

Joel Fayam Rivera Peña 2076323

Grupo 42

## Tuplas

Es una colección de objetos inmutable (no se puede cambiar)

In [1]:
tupla_alumno=('Juan','Perez',17)

In [2]:
type(tupla_alumno)

tuple

In [3]:
#Si tratamos de añadir o remover un objeto a una Tupla nos dará error debido a que es inmutable
tupla_alumno.remove('Juan')

AttributeError: 'tuple' object has no attribute 'remove'

## Diccionarios (mapeo de valores)

clave(variable) - valor

In [6]:
dic1_alumno={'Nombre':'Juan','Apellido':'Perez'}
#Clave-Nombre    Valor-Juan

In [5]:
type(dic1_alumno)

dict

In [8]:
dic_grupo={'Nombre':['Jime','Raúl','Ana'],'Edad':[17,21,15]}

In [9]:
dic_grupo['Nombre']

['Jime', 'Raúl', 'Ana']

In [11]:
#Observar las claves del diccionario
dic_grupo.keys()

dict_keys(['Nombre', 'Edad'])

In [14]:
#Observar los valores del diccionario
dic_grupo.values()

dict_values([['Jime', 'Raúl', 'Ana'], [17, 21, 15]])

## Pandas

Nos sirve para manejar datos estructurados, está construido con base a *Numpy* por lo que todas las funciones de *Numpy* son accesibles desde Pandas.

**Pandas** tiene tres estructuras básicas:
1. *Series* (unidimensionales)
2. *Dataframes* (filas y columnas)
3. *Panel* (tiempo)

In [15]:
import pandas as pd

Suponer que conocemos la edad de las siguientes personas: Pedro 12, Juan 17, Jime 21, Rosa 22

In [16]:
edades=[12,17,21,22]

In [20]:
edades

[12, 17, 21, 22]

In [22]:
#La ventaja de una serie es que nos permite etiquetar los valores

serie_edades=pd.Series(edades,index=['Pedro','Juan','Jime','Rosa'])

In [23]:
type(serie_edades)

pandas.core.series.Series

In [24]:
serie_edades

Pedro    12
Juan     17
Jime     21
Rosa     22
dtype: int64

In [26]:
serie_edades.mean()

18.0

In [27]:
serie_edades.median()

19.0

## Dataframe

Datos en filas y en columnas

In [28]:
alumno1=['Juan','Perez',23]
alumno2=['Raúl','González',17]
alumno3=['Jimena','Rosas',20]
alumno4=['Alejandra','Saldaña',21]

In [29]:
grupo_estadistica=[alumno1,alumno2,alumno3,alumno4]

In [30]:
grupo_estadistica

[['Juan', 'Perez', 23],
 ['Raúl', 'González', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [32]:
df_clase=pd.DataFrame(grupo_estadistica,columns=['Nombre','Apellido','Edad'])

In [35]:
type(df_clase)

pandas.core.frame.DataFrame

In [36]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raúl  González    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [37]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [38]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
df_clase['Municipio']=['Monterrey','Escobedo','Apodaca','Santiago']

In [40]:
df_clase

      Nombre  Apellido  Edad  Municipio
0       Juan     Perez    23  Monterrey
1       Raúl  González    17   Escobedo
2     Jimena     Rosas    20    Apodaca
3  Alejandra   Saldaña    21   Santiago

In [41]:
df_clase['Edad en Días']=df_clase['Edad']*365

In [42]:
df_clase

      Nombre  Apellido  Edad  Municipio  Edad en Días
0       Juan     Perez    23  Monterrey          8395
1       Raúl  González    17   Escobedo          6205
2     Jimena     Rosas    20    Apodaca          7300
3  Alejandra   Saldaña    21   Santiago          7665

## Seleccionar elementos de un dataframe

1. *Seleccion Estándar*
2. *Selección por .iloc*
3. *Selección por .loc*
4. *Selección condicional*

### Selección Estándar ###

In [44]:
# Selección Estándar
df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [48]:
df_clase[['Edad','Nombre']]

   Edad     Nombre
0    23       Juan
1    17       Raúl
2    20     Jimena
3    21  Alejandra

In [54]:
# Selección Estándar *pero con filas*

df_clase[0:2]
#Con la selección estándar no se puede seleccionar una sola fila

  Nombre  Apellido  Edad  Municipio  Edad en Días
0   Juan     Perez    23  Monterrey          8395
1   Raúl  González    17   Escobedo          6205

In [55]:
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

### Selección .iloc (posición)

dataframe.iloc[filas,columnas]

In [62]:
df_clase.iloc[0,2]

23

In [63]:
df_clase.iloc[0:2,2]

0    23
1    17
Name: Edad, dtype: int64

In [67]:
df_clase.iloc[:,[1,2]]
# Con los dos puntos ":" se seleccionan todas las filas

   Apellido  Edad
0     Perez    23
1  González    17
2     Rosas    20
3   Saldaña    21

In [68]:
df_clase

      Nombre  Apellido  Edad  Municipio  Edad en Días
0       Juan     Perez    23  Monterrey          8395
1       Raúl  González    17   Escobedo          6205
2     Jimena     Rosas    20    Apodaca          7300
3  Alejandra   Saldaña    21   Santiago          7665

In [70]:
# Vamos a cambiar el Index
df_clase=df_clase.set_index('Nombre')

In [71]:
df_clase

           Apellido  Edad  Municipio  Edad en Días
Nombre
Juan          Perez    23  Monterrey          8395
Raúl       González    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665

In [72]:
df_clase.columns

Index(['Apellido', 'Edad', 'Municipio', 'Edad en Días'], dtype='object')

In [73]:
df_clase.index

Index(['Juan', 'Raúl', 'Jimena', 'Alejandra'], dtype='object', name='Nombre')

### Selecciión por .loc (etiquetas)
df_clase.loc[nombre filas,nombre columnas]

In [74]:
df_clase.loc[:, 'Edad']

Nombre
Juan         23
Raúl         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [75]:
df_clase.loc['Juan','Edad']

23

### Selección por SQL

df_clase.NombreColumna

In [76]:
df_clase.Edad

Nombre
Juan         23
Raúl         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

### Selección condicional

In [77]:
df_clase

           Apellido  Edad  Municipio  Edad en Días
Nombre
Juan          Perez    23  Monterrey          8395
Raúl       González    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665

In [78]:
df_clase[df_clase['Edad']>=18]

          Apellido  Edad  Municipio  Edad en Días
Nombre
Juan         Perez    23  Monterrey          8395
Jimena       Rosas    20    Apodaca          7300
Alejandra  Saldaña    21   Santiago          7665

In [79]:
df_clase[df_clase['Municipio']=='Apodaca']

       Apellido  Edad Municipio  Edad en Días
Nombre
Jimena    Rosas    20   Apodaca          7300

### Ordenamiento con Pandas

In [80]:
df_clase

           Apellido  Edad  Municipio  Edad en Días
Nombre
Juan          Perez    23  Monterrey          8395
Raúl       González    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665

In [82]:
# Vamor a ordenarlos por edad
df_clase.sort_values('Edad')

           Apellido  Edad  Municipio  Edad en Días
Nombre
Raúl       González    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665
Juan          Perez    23  Monterrey          8395

In [83]:
df_clase.sort_values('Nombre')

           Apellido  Edad  Municipio  Edad en Días
Nombre
Alejandra   Saldaña    21   Santiago          7665
Jimena        Rosas    20    Apodaca          7300
Juan          Perez    23  Monterrey          8395
Raúl       González    17   Escobedo          6205

In [85]:
# Ordenar por edad de mayor a menor
df_clase.sort_values('Edad',ascending=False)

           Apellido  Edad  Municipio  Edad en Días
Nombre
Juan          Perez    23  Monterrey          8395
Alejandra   Saldaña    21   Santiago          7665
Jimena        Rosas    20    Apodaca          7300
Raúl       González    17   Escobedo          6205

In [88]:
# En este caso, ordena varias variables. 
# Siempre ordena de izq a der
df_clase.sort_values(['Edad','Apellido'])

           Apellido  Edad  Municipio  Edad en Días
Nombre
Raúl       González    17   Escobedo          6205
Jimena        Rosas    20    Apodaca          7300
Alejandra   Saldaña    21   Santiago          7665
Juan          Perez    23  Monterrey          8395

### Funciones con Numpy

In [94]:
import numpy as np

In [89]:
# Numpy
df_clase['Edad'].mean()

20.25

In [90]:
df_clase['Edad'].std(ddof=1)

2.5

In [92]:
df_clase['Edad'].sum()

81

In [96]:
# np.where (condicion, valor verdadero, valor falso)
# Es la función "Si" de Excel
df_clase['Mayoría_Edad']=np.where(df_clase['Edad']>=18,'Mayor','Menor')

In [97]:
df_clase

           Apellido  Edad  Municipio  Edad en Días Mayoría_Edad
Nombre
Juan          Perez    23  Monterrey          8395        Mayor
Raúl       González    17   Escobedo          6205        Menor
Jimena        Rosas    20    Apodaca          7300        Mayor
Alejandra   Saldaña    21   Santiago          7665        Mayor

In [103]:
# np.select
#np.select(condiciones, valor condicion, valor si alguna condicion no se cumple)
#Como el Si Conjunto de Excel

condiciones=[df_clase['Edad']<=17,
             df_clase['Edad']<=23,
             df_clase['Edad']>=23]
valores=['Prepa','Universidad','Chamba']
df_clase['Situación']=np.select(condiciones,valores,default='Missing')

In [105]:
df_clase

,Apellido,Edad,Municipio,Edad en Días,Mayoría_Edad,Donde debe estar,Situación
Nombre,,,,,,,
Juan,Perez,23,Monterrey,8395,Mayor,Universidad,Universidad
Raúl,González,17,Escobedo,6205,Menor,Prera,Prepa
Jimena,Rosas,20,Apodaca,7300,Mayor,Universidad,Universidad
Alejandra,Saldaña,21,Santiago,7665,Mayor,Universidad,Universidad

In [ ]:
#Eliminar columnas de un dataframe
del df_clase['Donde debe estar']

In [107]:
df_clase

           Apellido  Edad  Municipio  Edad en Días Mayoría_Edad    Situación
Nombre
Juan          Perez    23  Monterrey          8395        Mayor  Universidad
Raúl       González    17   Escobedo          6205        Menor        Prepa
Jimena        Rosas    20    Apodaca          7300        Mayor  Universidad
Alejandra   Saldaña    21   Santiago          7665        Mayor  Universidad

In [109]:
df_clase.count()

Apellido        4
Edad            4
Municipio       4
Edad en Días    4
Mayoría_Edad    4
Situación       4
dtype: int64

In [110]:
df_clase['Edad'].count()

4

In [111]:
df_clase.value_counts('Mayoría_Edad')

Mayoría_Edad
Mayor    3
Menor    1
Name: count, dtype: int64

In [116]:
df_clase.groupby('Mayoría_Edad').mean(numeric_only=True).round(1)['Edad']

Mayoría_Edad
Mayor    21.3
Menor    17.0
Name: Edad, dtype: float64

In [117]:
# Aggregate Abreviado: agg
#Resumir
df_clase.agg('count')

Apellido        4
Edad            4
Municipio       4
Edad en Días    4
Mayoría_Edad    4
Situación       4
dtype: int64

In [120]:
df_clase.groupby('Mayoría_Edad')['Edad'].agg(['mean','std']).round(1)
#Colocamos el nombre, lo agrupamos segun mayoría de edad, indico la variable de la que quiero los calculos, que calculo quiero que haga

              mean  std
Mayoría_Edad
Mayor         21.3  1.5
Menor         17.0  NaN

In [121]:
calificaciones=pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [126]:
calificaciones.head(10)

   Id            Nombre   Apellido  Calficación Final
0   1           ANTONIO     GARCIA                 73
1   2            MANUEL  FERNANDEZ                 19
2   3              JOSE   GONZALEZ                 38
3   4             DAVID      PEREZ                 14
4   5              JUAN      LOPEZ                 99
5   6      JOSE ANTONIO  RODRIGUEZ                 66
6   7            JAVIER    SANCHEZ                 46
7   8         JOSE LUIS      GOMEZ                 89
8   9  FRANCISCO JAVIER    JIMENEZ                 10
9  10            CARLOS       RUIZ                 62

In [127]:
calificaciones.tail(10)

    Id       Nombre   Apellido  Calficación Final
18  19        ANGEL        GIL                100
19  20       SERGIO    AGUIRRE                  2
20  21   JOSE MARIA       DIEZ                 29
21  22     FERNANDO    SALAZAR                 51
22  23        JORGE      RAMOS                 76
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [128]:
calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [129]:
calificaciones.shape

(28, 4)

In [131]:
# Nos da las estadísticas descriptivas
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [133]:
# corregir nombre 
calificaciones=calificaciones.rename(columns={'Calficación Final': 'CalFinal'})

In [134]:
calificaciones

    Id            Nombre   Apellido  CalFinal
0    1           ANTONIO     GARCIA        73
1    2            MANUEL  FERNANDEZ        19
2    3              JOSE   GONZALEZ        38
3    4             DAVID      PEREZ        14
4    5              JUAN      LOPEZ        99
5    6      JOSE ANTONIO  RODRIGUEZ        66
6    7            JAVIER    SANCHEZ        46
7    8         JOSE LUIS      GOMEZ        89
8    9  FRANCISCO JAVIER    JIMENEZ        10
9   10            CARLOS       RUIZ        62
10  11             JESUS     ALONSO        94
11  12         ALEJANDRO  HERNANDEZ        17
12  13            MIGUEL       DIAZ        85
13  14       JOSE MANUEL  GUTIERREZ        34
14  15            RAFAEL    ALVAREZ        86
15  16      MIGUEL ANGEL     MORENO       100
16  17             PEDRO      MUÑOZ         1
17  18             PABLO     BLANCO        64
18  19             ANGEL        GIL       100
19  20            SERGIO    AGUIRRE         2
20  21        JOSE MARIA       DIEZ        29
21  22          FERNANDO    SALAZAR        51
22  23             JORGE      RAMOS        76
23  24              LUIS  DOMINGUEZ        12
24  25           ALBERTO      ORTIZ        99
25  26       JUAN CARLOS     IBAÑEZ        43
26  27            ALVARO    RAMIREZ        40
27  28            ADRIAN       SAEZ         7

In [135]:
del calificaciones['Id']

Otra forma de eliminarlo sería de la siguiente forma:

calificaciones.loc[:,calificaciones.columns!='Id']

In [136]:
calificaciones

              Nombre   Apellido  CalFinal
0            ANTONIO     GARCIA        73
1             MANUEL  FERNANDEZ        19
2               JOSE   GONZALEZ        38
3              DAVID      PEREZ        14
4               JUAN      LOPEZ        99
5       JOSE ANTONIO  RODRIGUEZ        66
6             JAVIER    SANCHEZ        46
7          JOSE LUIS      GOMEZ        89
8   FRANCISCO JAVIER    JIMENEZ        10
9             CARLOS       RUIZ        62
10             JESUS     ALONSO        94
11         ALEJANDRO  HERNANDEZ        17
12            MIGUEL       DIAZ        85
13       JOSE MANUEL  GUTIERREZ        34
14            RAFAEL    ALVAREZ        86
15      MIGUEL ANGEL     MORENO       100
16             PEDRO      MUÑOZ         1
17             PABLO     BLANCO        64
18             ANGEL        GIL       100
19            SERGIO    AGUIRRE         2
20        JOSE MARIA       DIEZ        29
21          FERNANDO    SALAZAR        51
22             JORGE      RAMOS        76
23              LUIS  DOMINGUEZ        12
24           ALBERTO      ORTIZ        99
25       JUAN CARLOS     IBAÑEZ        43
26            ALVARO    RAMIREZ        40
27            ADRIAN       SAEZ         7

De este dataframe se requiere saber:
1. Promedio del grupo
2. Nueva columna con Aprobado/Reprobado
3. Numero de aprobados/reprobados
4. Promedio de aprobados/reprobados

In [137]:
Promedio_Grupo=calificaciones['CalFinal'].mean()

In [138]:
Promedio_Grupo

52.0

In [139]:

calificaciones['Situación']=np.where(calificaciones['CalFinal']>=70,'Aprobado','Reprobado')
calificaciones

              Nombre   Apellido  CalFinal  Situación
0            ANTONIO     GARCIA        73   Aprobado
1             MANUEL  FERNANDEZ        19  Reprobado
2               JOSE   GONZALEZ        38  Reprobado
3              DAVID      PEREZ        14  Reprobado
4               JUAN      LOPEZ        99   Aprobado
5       JOSE ANTONIO  RODRIGUEZ        66  Reprobado
6             JAVIER    SANCHEZ        46  Reprobado
7          JOSE LUIS      GOMEZ        89   Aprobado
8   FRANCISCO JAVIER    JIMENEZ        10  Reprobado
9             CARLOS       RUIZ        62  Reprobado
10             JESUS     ALONSO        94   Aprobado
11         ALEJANDRO  HERNANDEZ        17  Reprobado
12            MIGUEL       DIAZ        85   Aprobado
13       JOSE MANUEL  GUTIERREZ        34  Reprobado
14            RAFAEL    ALVAREZ        86   Aprobado
15      MIGUEL ANGEL     MORENO       100   Aprobado
16             PEDRO      MUÑOZ         1  Reprobado
17             PABLO     BLANCO        64  Reprobado
18             ANGEL        GIL       100   Aprobado
19            SERGIO    AGUIRRE         2  Reprobado
20        JOSE MARIA       DIEZ        29  Reprobado
21          FERNANDO    SALAZAR        51  Reprobado
22             JORGE      RAMOS        76   Aprobado
23              LUIS  DOMINGUEZ        12  Reprobado
24           ALBERTO      ORTIZ        99   Aprobado
25       JUAN CARLOS     IBAÑEZ        43  Reprobado
26            ALVARO    RAMIREZ        40  Reprobado
27            ADRIAN       SAEZ         7  Reprobado

In [140]:
calificaciones.value_counts('Situación')

Situación
Reprobado    18
Aprobado     10
Name: count, dtype: int64

In [143]:
calificaciones.groupby('Situación')['CalFinal'].agg('mean').round(2)

Situación
Aprobado     90.10
Reprobado    30.83
Name: CalFinal, dtype: float64